{"basics":{"name":"Spencer Veatch","label":"Data Scientist and Machine Learning Engineer","image":"","email":"scveatch@willamette.edu","phone":"503-538-4540","summary":""},"education":[{"institution":"Willamette University","area":"Data Science","studyType":"M.S.","score":"3.90 / 4.0","startDate":"","endDate":""},{"institution":"Willamette University","area":"Data Science","studyType":"B.S.","score":"3.85 / 4.0","startDate":"","endDate":""},{"institution":"Willamette University","area":"Economics","studyType":"B.A.","score":"3.85 / 4.0","startDate":"","endDate":""}],"work":[{"name":"Renewable Resources Group","position":"Data Scientist","url":"https://renewablegroup.com","startDate":"June 2023","endDate":"Present","summary":"Developed machine learning pipelines for climate and satellite data, created high-resolution irrigation estimates, and optimized algorithms for large-scale datasets.","highlights":["Created a machine learning pipeline that ingests and processes diverse climate and satellite data.","Developed and implemented a model to generate projections of climate similarity at 25 year increments based on a user-provided point, producing high-resolution and user-friendly output rasters for efficient decision making.","Engineered a cutting-edge, multi-modal model to produce high-resolution irrigation estimates from satellite images and soil moisture data.","Optimized algorithms and developed parallelized solutions to improve feature engineering processes and enable seamless handling of large-scale datasets, leading to a significant reduction in runtime."]},{"name":"QUAD Center, Willamette University","position":"Student Tutor","startDate":"Sep. 2023","endDate":"June 2024","summary":"Provided tutoring in Statistics, Computer Science, and Data Science, supported multiple computing languages, and contributed to student research projects.","highlights":["Provided one-on-one and small group tutoring to undergraduate and graduate students in Statistics, Computer Science, and Data Science.","Helped with a wide range of subjects including study design, data cleaning, data visualization, analysis, modeling, and data communication.","Supported a diverse range of computing languages including R, Python, and C/C++.","Proficiently troubleshooted issues, explained intricate programming and mathematical concepts, and actively contributed to the design of effective solutions for a wide variety of student research projects."]}],"research":[{"name":"M3FNet – MGMT Multimodal Fusion Network","summary":"Developed a 3D neural network for detecting MGMT enzyme methylation in glioblastoma patients using only mpMRI images, providing a non-invasive alternative to biopsy.","highlights":["Created a novel computer vision approach with custom feature extraction and fusion methods, achieving an accuracy rate of 93% and performing approximately 30% better than most other models in the field."]},{"name":"LCNet – Lesion Classification Network","summary":"Developed a lightweight architecture for skin cancer diagnosis that achieves an accuracy of 91.8% across multiple classes of lesions.","highlights":["Achieved performance within 0.4% of state-of-the-art models, demonstrating comparable accuracy with significantly reduced model size."]},{"name":"AdjustR – R Package","summary":"Developing an R package and novel test statistic to identify model misspecification in longitudinal studies.","highlights":["Release is expected in December 2024."]}],"awards":[{"title":"Dale T. Mortensen Scholarship","awarder":"Willamette University","summary":"A prestigious full tuition scholarship awarded annually to one student who displays outstanding achievement in both Economics and Mathematics."},{"title":"Outstanding Student Research","awarder":"Consortium for Computing Sciences Northwest","summary":"This award acknowledges outstanding achievement in both the quality and content of computer science research, as well as exemplary presentation skills."}],"skills":[{"name":"Technical Skills","keywords":["Rstudio","Python","C/C++","ArcGIS","SQL","CUDA","Tensorflow","Pytorch","Docker","Linux","Spark/pyspark","AWS","SageMaker","Numpy","Matplotlib","Seaborn","ggplot2","Tableau","Git"]}]}